<?php
/**
 * Plugin Name: Natali - синхронизация каталога
 * Plugin URI: https://promo.natali37.ru/
 *
 * Version: 2.1.7
 *
 * Author: Drozzi
 * Author URI: https://drozzi.pro
 *
 * License:      GPL-3.0+
 * License URI:  http://www.gnu.org/licenses/gpl-3.0.txt
 *
 * Text Domain: wp-natali
 * Domain Path: /lang
 *
 * Description: Больше не нужно тратить уйму времени, чтобы добавить товары “Натали” на ваш сайт, ведь теперь в один
 * клик вы сможете синхронизировать весь каталог магазина с вашим ресурсом, да еще и абсолютно бесплатно! И это
 * возможно благодаря нашему модулю, который позволяет поддерживать актуальную информацию для пользователей вашей
 * площадки, уделяя этому минимум времени. Хотите синхронизировать более 6000 товаров всего за 5 минут? Сделайте это
 * вместе с нами!
 *
 * URI: https://promo.natali37.ru/
 */

/**
 * -------------------------------------------------------------------------------------------------
 * Инициализируем основные константы плагина
 * -------------------------------------------------------------------------------------------------
 */
defined('ABSPATH') || exit;
define('NATALI_PLUGIN_FILE', __FILE__);                                 // Путь до главного файла плагина
define('NATALI_PLUGIN_VERSION', '2.1.7');                               // версия плагина для фалов assets
define("NATALI_PLUGIN_DIR",  __DIR__);                                  // Путь до папки плагина
define('NATALI_PLUGIN_NAME', basename(__DIR__));                   // Имя папки плагина
define('NATALI_PLUGIN_URL',  plugins_url() . '/' . NATALI_PLUGIN_NAME); // Ссылка на папку плагина

/**
 * -------------------------------------------------------------------------------------------------
 * Подключаем файл перевода плагина
 * -------------------------------------------------------------------------------------------------
 */
add_action('plugins_loaded', function () {
    load_plugin_textdomain('wp-natali', false, dirname(plugin_basename(__FILE__)) . '/lang');
});


define(
    'WOOCOMMERCE_STATUS',
    in_array('woocommerce/woocommerce.php', apply_filters('active_plugins', get_option('active_plugins')))
);

if (!WOOCOMMERCE_STATUS) {  // Проверка активирован ли плагин woocommerce
    add_action('admin_notices', function () {
        echo '<div class="notice notice-error is-dismissible">
          <p>Пожалуйста установите WooCommerce для работы плагина Natali</p>
         </div>';
    });
} else {
    /**
     * -------------------------------------------------------------------------------------------------
     * Подключаем файлы composer и главный класс плагина
     * -------------------------------------------------------------------------------------------------
     */
    require_once NATALI_PLUGIN_DIR . '/vendor/autoload.php';

    require_once NATALI_PLUGIN_DIR . '/app/Natali_Plugin.php';

    /**
     * -------------------------------------------------------------------------------------------------
     * Подключаем файлы классов из папки app/classes
     * -------------------------------------------------------------------------------------------------
     */
    Natali_Plugin::require_classes();

    /**
     * -------------------------------------------------------------------------------------------------
     * Инициализируем методы и функции плагина на хуки wordpress
     * -------------------------------------------------------------------------------------------------
     */
    Natali_Plugin::init_hooks();

    /**
     * -------------------------------------------------------------------------------------------------
     * Инициализируем точек Rest Api
     * -------------------------------------------------------------------------------------------------
     */
    Natali_Plugin::init_points_rest_api();

    /**
     * -------------------------------------------------------------------------------------------------
     * Выполняем метод плагина при активации
     * -------------------------------------------------------------------------------------------------
     */
    register_activation_hook(__FILE__, ['Natali_Plugin', 'activate']);

    /**
     * -------------------------------------------------------------------------------------------------
     * Выполняем метод плагина при деактивации
     * -------------------------------------------------------------------------------------------------
     */
    register_deactivation_hook(__FILE__, ['Natali_Plugin', 'deactivate']);

    /**
     * -------------------------------------------------------------------------------------------------
     * Выполняем метод плагина при удалении
     * -------------------------------------------------------------------------------------------------
     */
    register_uninstall_hook(__FILE__, ['Natali_Plugin', 'uninstall']); // При удалении плагина
}
